# petapp/choices.py

# 個性特徵 表單
FEATURE_CHOICES = [
    ('親人', '親人'),
    ('獨立', '獨立'),
    ('活潑', '活潑'),
    ('安靜', '安靜'),
    ('愛叫', '愛叫'),
    ('膽小', '膽小'),
    ('怕生', '怕生'),
    ('護主', '護主'),
    ('愛玩', '愛玩'),
    ('聰明', '聰明'),
    ('溫和', '溫和'),
    ('好奇心重', '好奇心重'),
    ('警戒心強', '警戒心強'),
    ('容易緊張', '容易緊張'),
    ('容易訓練', '容易訓練'),
    ('領地性強', '領地性強'),
    ('其他', '其他'),
]
# 健康狀況 表單
PHYSICAL_CHOICES = [
    ('完全健康、無特殊狀況', '完全健康、無特殊狀況'),
    ('有皮膚問題', '有皮膚問題'),
    ('有消化問題', '有消化問題'),
    ('有關節問題', '有關節問題'),
    ('有心臟疾病史', '有心臟疾病史'),
    ('有腎臟疾病史', '有腎臟疾病史'),
    ('有癲癇或神經問題', '有癲癇或神經問題'),
    ('有糖尿病或內分泌問題', '有糖尿病或內分泌問題'),
    ('曾接受大手術', '曾接受大手術'),
    ('曾經嚴重受傷或車禍', '曾經嚴重受傷或車禍'),
    ('需要定期服藥', '需要定期服藥'),
    ('需要特殊飲食', '需要特殊飲食'),
    ('定期接受物理治療或針灸', '定期接受物理治療或針灸'),
    ('視力／聽力退化', '視力／聽力退化'),
    ('年長、行動緩慢', '年長、行動緩慢'),
    ('其他', '其他'),
]
# 領養條件 表單
ADOPTCONDITION_CHOICES = [
    # 居住狀況
    ('自有住宅', '自有住宅'),
    ('可養寵物租屋', '可養寵物租屋'),
    # 年齡與身份限制
    ('滿20歲以上', '滿20歲以上'),
    ('65歲以下', '65歲以下'),
    # 飼養方式
    ('不可飼養多隻動物', '不可飼養多隻動物'),
    # 責任與聯繫
    ('同意家訪', '同意家訪'),
    ('需定期回報照片', '需定期回報照片'),
    # 經濟能力與醫療
    ('有穩定收入', '有穩定收入'),
    ('有能力負擔醫療及飼養費用', '有能力負擔醫療及飼養費用'),
    ('其他', '其他'),
]
# (狗)品種 表單
DOG_CHOICES = [
    # 小型犬
    ('吉娃娃', '吉娃娃'),
    ('博美犬', '博美犬'),
    ('馬爾濟斯', '馬爾濟斯'),
    ('貴賓犬', '貴賓犬'),
    ('約克夏犬', '約克夏犬'),
    ('巴哥犬', '巴哥犬'),
    ('臘腸犬', '臘腸犬'),
    ('比熊犬', '比熊犬'),
    ('西施犬', '西施犬'),
    ('法國鬥牛犬', '法國鬥牛犬'),
    ('可卡犬', '可卡犬'),
    ('雪納瑞', '雪納瑞'),
    # 中型犬
    ('柴犬', '柴犬'),
    ('米格魯', '米格魯'),
    ('柯基犬', '柯基犬'),
    ('邊境牧羊犬', '邊境牧羊犬'),
    ('牛頭梗', '牛頭梗'),
    # 大型犬
    ('拉布拉多犬', '拉布拉多犬'),
    ('黃金獵犬', '黃金獵犬'),
    ('哈士奇', '哈士奇'),
    ('羅威納犬', '羅威納犬'),
    ('杜賓犬', '杜賓犬'),
    ('松獅犬', '松獅犬'),
    # 巨型犬
    ('阿拉斯加雪橇犬', '阿拉斯加雪橇犬'),
    ('大白熊犬', '大白熊犬'),
    # 其他與混種
    ('混種犬（米克斯）', '混種犬（米克斯）'),
    ('其他', '其他'),
]
# (貓)品種 表單
CAT_CHOICES = [
    ('布偶貓', '布偶貓'),
    ('波斯貓', '波斯貓'),
    ('緬因貓', '緬因貓'),
    ('暹羅貓', '暹羅貓'),
    ('無毛貓', '無毛貓'),
    ('金吉拉', '金吉拉'),
    ('孟加拉貓', '孟加拉貓'),
    ('美國短毛貓', '美國短毛貓'),
    ('英國短毛貓', '英國短毛貓'),
    ('俄羅斯藍貓', '俄羅斯藍貓'),
    ('挪威森林貓', '挪威森林貓'),
    ('蘇格蘭摺耳貓', '蘇格蘭摺耳貓'),
    ('阿比西尼亞貓', '阿比西尼亞貓'),
    ('混種貓（米克斯）', '混種貓（米克斯）'),
    ('其他', '其他'),
]

# (狗)疫苗 表單
DOGVACCINE_CHOICES = [
    ('犬瘟熱', '犬瘟熱'),
    ('犬小病毒', '犬小病毒'),
    ('犬腺病毒/肝炎', '犬腺病毒/肝炎'),
    ('犬傳染性支氣管炎', '犬傳染性支氣管炎'),
    ('狂犬病', '狂犬病'),
    ('犬副流感', '犬副流感'),
    ('鉤端螺旋體（多型）', '鉤端螺旋體（多型）'),
    ('犬冠狀病毒', '犬冠狀病毒'),
    ('萊姆病', '萊姆病'),
    ('其他', '其他'),
]
# (貓)疫苗 表單
CATVACCINE_CHOICES = [
    ('貓瘟', '貓瘟'),
    ('貓皰疹', '貓皰疹'),
    ('貓卡里西', '貓卡里西'),
    ('狂犬病', '狂犬病'),
    ('貓白血病病毒', '貓白血病病毒'),
    ('貓披衣菌', '貓披衣菌'),
    ('其他', '其他'),
]
